app/controllers/application_controller.rb

  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header
    begin
      @payload = decode(token)
      @current_user = User.find(@payload[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]